{
  "Meta.title": "MapRoulette Docs",
  "Index.headline": "Hello and Welcome to MapRoulette",
  "Index.title": "Welcome",
  "Index.content": "MapRoulette is a micro-task platform for OpenStreetMap. [MapRoulette.org](https://maproulette.org/) gives you small **Tasks** you can complete in under a minute to improve OpenStreetMap. Anyone can create groups of tasks, called **Challenges**, that the community can complete together.\n\nBesides the website maproulette.org, there is also a full API that you can use to integrate MapRoulette with your own tools.\n\nOn this wiki, you will find all the resources you need to use MapRoulette.org, create and manage Challenges, see statistics and interact with the MapRoulette API.\n\nHelp is welcome! If you have suggestions for this documentation, or don't understand how something works, please email us at [maproulette@maproulette.org](mailto:maproulette@maproulette.org) or [open a new issue](https://github.com/osmlab/maproulette3/issues).",
  "Documentation.title": "Documentation",
  "Documentation.content1": "Welcome to the MapRoulette documentation and learning site!",
  "Documentation.content2": "If you'd like to get mapping, visit our application page at [MapRoulette.org](https://maproulette.org/)\n\nOur community continues to grow quickly! If you'd like to help contribute to MapRoulette's documentation, please visit our [Repository](https://github.com/maproulette/docs) for instructions.  Thank you in advance.",
  "BulkEditingChallenges.content1": "Project owners can now **Bulk-edit** challenges within the same project.  While this feature isn't as robust as editing a single challenge individually, there are a few fields that allow you to edit multiple challenges for quality of life purposes.\n\n**Keep in mind that this feature, for most fields, will overwrite the original data of each challenge if you choose to utilize the field. Since each challenge can have different data, you will not have context on this page of what you are overwriting.  Use at your own risk.  Fields that you leave alone will leave the original data the way it is.**\n\n## Go to your Project's admin page and select challenges\n\nSimply go to a project admin page.  In the challenges widget, select the graph icon to the right of each challenge you would like to edit simultaneously.",
  "BulkEditingChallenges.content2": "You can also choose to \"select-all\" by clicking the graph icon at the top of the list.\n\n## Bulk Edit Page\n\nNext, select the gear icon on the top right and select \"Edit Selected\"",
  "BulkEditingChallenges.content3": "You'll be directed to the bulk edit page.\n\n## Remove a challenge from Bulk Edit\n\nYou should see a list of the challenges you will be editing simultaneously.  If you change your mind on any of the challenges, but don't want to go back and re-select them, you can click the \"X\" symbol to the right of the challenge name.",
  "BulkEditingChallenges.content4": "## Bulk Editing Guidelines\n\n1. Any fields you choose to use for bulk editing will be used to **overwrite** the data that is on each challenge.\n\n2. Any fields you leave alone on the bulk edit page will not do anything to the existing challenge data.\n\n## Submitting A Bulk Edit\n\nOnce you've proposed all of the changes you need on the form, press Submit and you will be presented with a confirmation modal that indicates all of the changes that will be made on each challenge.",
  "BulkEditingChallenges.content5": "**Cancel Edit** will allow you to go back to the form and make any additional changes you like.  Additionally you can choose to abandon all edits by clicking \"Cancel Edit\" on the bulk edit page.\n\n**Submit Bulk Edit** will proceed with the submission of edits on each challenge.",
  "ChallengeComments.content1": "In an effort to provide more tooling for users to contact challenge owners, **Challenge Comments** have been added as a feature in addition to Task Comments.  This allows users to address issues or assessments that could be systemic beyond just one task, and to get clarity from the owner or recommend changes without need to flag or report a challenge.  \n\nTo navigate to a challenge's comments and to post a comment, simply go to a challenge overview page like [this one](https://maproulette.org/browse/challenges/40609).  Then click on the link \"Get In Touch\".",
  "ChallengeComments.content2": "## Submitting a comment\n\nMessages you submit here will automatically notify the challenge owner, so there's no need to include the challenge owner's tag.  However, non-owners will still need to be tagged in the comment if you want them to be notified.\n\n## Task Specific Comments\n\nTask specific comments can be viewed here and will be included in the challenge comment feed by simply clicking the \"Task Comments\" checkbox.",
  "ChallengeFlagging.content1": "Challenge flagging allows mappers to report any questionable encounters within a challenge that did not meet quality standards.\n\nSee original post and credits on our blog [here](https://blog.maproulette.org/2023/01/23/introducing-our-flag-report-a-challenge-feature/)!\n\n**Please be aware that Challenge Flagging is one of a set of features that assists mappers with reaching out to challenge owners.  Flagging a challenge may not be necessary, so please review the list of features and our recommendations for [Reporting A Challenge](/documentation/reporting-a-challenge) depeding on your specific needs.**\n\nUpon coming across something we want to flag in a challenge, go to the challenge details page that belongs to the challenge, there you will be able to see a flag icon next to the challenge name.",
  "ChallengeFlagging.content2": "Simply click on the flag icon, an email modal will appear to flag this challenge. Please include your email address, a flag description, and make sure you check [ I have attempted to contact the challenge creator ] before proceed. Click on the [Flag Challenge] button to submit a flag. This will open an issue in Maproulette’s [challenge-reports repository](https://github.com/maproulette/challenge-reports/issues) on GitHub and generate a message in the comment section of this challenge.",
  "ChallengeFlagging.content3": "Once the challenge is being successfully flagged, the flag icon will be filled red.",
  "ChallengeFlagging.content4": "Clicking on the flag icon will redirect you to the issue’s page on GitHub.",
  "ChallengeFlagging.content5": "You could also view information related to this issue in the comment section of this challenge( by clicking on Get In Touch).",
  "ChallengeFlagging.content6": "Please note that only logged in user is able to flag a challenge. And if an issue has already been flagged by a user, we can only flag the same challenge again once that issue has been resolved.\n\nWe hope flag feature will help maintain and improve the overall quality of challenges on MapRoulette by passing our users abilities to regulate.",
  "Screencasts.mr-workshop.title": "MapRoulette Workshop at State of the Map Africa, November 2021",
  "Footer.powered_by": "This site is powered by Netlify"
}
